sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
  /* USER CODE BEGIN RTOS_MUTEX */
	/* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
	/* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
	/* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the thread(s) */
  /* definition and creation of defaultTask */
  osThreadDef(defaultTask, StartDefaultTask, osPriorityIdle, 0, 128);
  defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

  /* definition and creation of USART1_Task */
  osThreadDef(USART1_Task, usart1_entry, osPriorityHigh, 0, 256);
  USART1_TaskHandle = osThreadCreate(osThread(USART1_Task), NULL);

  /* definition and creation of USART2_Task */
  osThreadDef(USART2_Task, usart2_entry, osPriorityNormal, 0, 256);
  USART2_TaskHandle = osThreadCreate(osThread(USART2_Task), NULL);

  /* definition and creation of USART3_Task */
  osThreadDef(USART3_Task, usart3_entry, osPriorityNormal, 0, 128);
  USART3_TaskHandle = osThreadCreate(osThread(USART3_Task), NULL);

  /* definition and creation of IGNITION_Task */
  osThreadDef(IGNITION_Task, ignition_entry, osPriorityNormal, 0, 256);
  IGNITION_TaskHandle = osThreadCreate(osThread(IGNITION_Task), NULL);

  /* definition and creation of I2C1_Task */
  osThreadDef(I2C1_Task, i2c1_entry, osPriorityNormal, 0, 128);
  I2C1_TaskHandle = osThreadCreate(osThread(I2C1_Task), NULL);

  /* definition and creation of ADC_Task */
  osThreadDef(ADC_Task, adc_entry, osPriorityNormal, 0, 128);
  ADC_TaskHandle = osThreadCreate(osThread(ADC_Task), NULL);

  /* definition and creation of IWDG_Task */
  osThreadDef(IWDG_Task, IWDG_entry, osPriorityHigh, 0, 128);
  IWDG_TaskHandle = osThreadCreate(osThread(IWDG_Task), NULL);

  /* definition and creation of CMD_PROC_Task */
  osThreadDef(CMD_PROC_Task, cmd_proc_entry, osPriorityNormal, 0, 128);
  CMD_PROC_TaskHandle = osThreadCreate(osThread(CMD_PROC_Task), NULL);

  /* definition and creation of GPIO_STATE_Task */
  osThreadDef(GPIO_STATE_Task, gpio_state_entry, osPriorityNormal, 0, 128);
  GPIO_STATE_TaskHandle = osThreadCreate(osThread(GPIO_STATE_Task), NULL);

  /* definition and creation of SPI1_Task */
  osThreadDef(SPI1_Task, spi1_entry, osPriorityHigh, 0, 128);
  SPI1_TaskHandle = osThreadCreate(osThread(SPI1_Task), NULL);

  /* definition and creation of CAN_Task */
  osThreadDef(CAN_Task, can_entry, osPriorityNormal, 0, 128);
  CAN_TaskHandle = osThreadCreate(osThread(CAN_Task), NULL);

  /* USER CODE BEGIN RTOS_THREADS */
	/* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* Create the queue(s) */
  /* definition and creation of GPIO_MISC_Q */
  osMessageQDef(GPIO_MISC_Q, 16, uint16_t);
  GPIO_MISC_QHandle = osMessageCreate(osMessageQ(GPIO_MISC_Q), NULL);

  /* definition and creation of ADC_VOLT_Q */
  osMessageQDef(ADC_VOLT_Q, 1, uint32_t);
  ADC_VOLT_QHandle = osMessageCreate(osMessageQ(ADC_VOLT_Q), NULL);

  /* definition and creation of ADC_TEMP_Q */
  osMessageQDef(ADC_TEMP_Q, 1, uint32_t);
  ADC_TEMP_QHandle = osMessageCreate(osMessageQ(ADC_TEMP_Q), NULL);

  /* definition and creation of I2C1_GSENSOR_Q */
  osMessageQDef(I2C1_GSENSOR_Q, 16, uint16_t);
  I2C1_GSENSOR_QHandle = osMessageCreate(osMessageQ(I2C1_GSENSOR_Q), NULL);

  /* definition and creation of I2C1_XAXIS_Q */
  osMessageQDef(I2C1_XAXIS_Q, 2, uint16_t);
  I2C1_XAXIS_QHandle = osMessageCreate(osMessageQ(I2C1_XAXIS_Q), NULL);

  /* definition and creation of I2C1_YAXIS_Q */
  osMessageQDef(I2C1_YAXIS_Q, 2, uint16_t);
  I2C1_YAXIS_QHandle = osMessageCreate(osMessageQ(I2C1_YAXIS_Q), NULL);

  /* definition and creation of I2C1_ZAXIS_Q */
  osMessageQDef(I2C1_ZAXIS_Q, 2, uint16_t);
  I2C1_ZAXIS_QHandle = osMessageCreate(osMessageQ(I2C1_ZAXIS_Q), NULL);

  /* definition and creation of UART2_LAT_Q */
  osMessageQDef(UART2_LAT_Q, 1, uint32_t);
  UART2_LAT_QHandle = osMessageCreate(osMessageQ(UART2_LAT_Q), NULL);

  /* definition and creation of UART2_LONG_Q */
  osMessageQDef(UART2_LONG_Q, 1, uint32_t);
  UART2_LONG_QHandle = osMessageCreate(osMessageQ(UART2_LONG_Q), NULL);

  /* USER CODE BEGIN RTOS_QUEUES */
	/* add queues, ... */
  /* USER CODE END RTOS_QUEUES */
}

/* StartDefaultTask function */
void StartDefaultTask(void const * argument)
{

  /* USER CODE BEGIN StartDefaultTask */
  /* Infinite loop */
  for(;;)
  {
    osDelay(100);
  }
  /* USER CODE END StartDefaultTask */
}

/* usart1_entry function */
void usart1_entry(void const * argument)
{
  /* USER CODE BEGIN usart1_entry */
	uint8_t recv1[CMD_MAX_LEN] = {0};
	uint8_t xFer[CMD_MAX_LEN] = {0};
	uint8_t send2host = FALSE;
	uint8_t xFer_len = 0;

	uint8_t uart1_rx_buffer[CMD_MAX_LEN]= {0};
	uint8_t u16InsIdx,u16Delidx;
	uint8_t rx_byte_counter = 0;
	uint8_t flag_rx_finished = 0;

	osEvent evt_vol;
	osEvent evt_temp;
	osEvent evt_xaxis;
	osEvent evt_yaxis;
	osEvent evt_zaxis;
	osEvent evt_lat;
	osEvent evt_long;

	HAL_UART_Receive_DMA(&huart1, &uart1_rx_buffer[CMD_SYN_POS0] ,CMD_MAX_LEN);
	u16InsIdx = 0;
	u16Delidx = 0;

	/* Infinite loop */

	for(;;)
    {
		// check DMA new data
		u16InsIdx = CMD_MAX_LEN - (hdma_usart1_rx.Instance->CNDTR);

		// if data frame packet is not received completely and there are still some data in DMA buffer that uart1 haven't read
		// if haven't read the data in DMA buffer
		if((u16InsIdx != u16Delidx) && (flag_rx_finished == 0))
		{
			recv1[rx_byte_counter] = uart1_rx_buffer[u16Delidx];

			// end of data frame packet, received completely
			if((rx_byte_counter > 6) && (recv1[rx_byte_counter - 2] == 0x03) && (recv1[rx_byte_counter - 1] == 0x00) && (recv1[rx_byte_counter] == 0x04))
			{
				rx_byte_counter = 0;
				flag_rx_finished = 1;
			}
			else
			{
				rx_byte_counter = rx_byte_counter+1;
			}

			//get 1 byte from circular buffer
			u16Delidx = u16Delidx + 1;
			u16Delidx %= CMD_MAX_LEN;
		}
#if 1
		/*

		//xTimeNow = xTaskGetTickCount();
		//aewin_dbg("\n\rTask: UART1; TaskGetTickCount: %d", xTimeNow);

		// Wait until the first byte is coming
		//while((HAL_UART_Receive_IT(&huart1, &recv1[CMD_SYN_POS0], 100)) != HAL_OK );
		// Get the SYN code.
		//taskENTER_CRITICAL();
		while(HAL_UART_Receive_DMA(&huart1, &recv1[CMD_SYN_POS0] ,(CMD_MAX_LEN - 1)) != HAL_OK);
		//HAL_UART_Receive(&huart1, &recv1[CMD_SYN_POS1] ,(CMD_MAX_LEN - 1), 100);

