sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
							aewin_dbg("\n\rGet WWAN wake up status: %d", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_WWAN_WKStat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + MCU_SCMD31_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + MCU_SCMD31_LEN)])) break;
							current_IgEvent[NUM_WWAN_wakeup]=recv1[5];

							flag_flashWrite = 1;

							aewin_dbg("\n\rSet WWAN wake up status: %d", current_IgEvent[NUM_WWAN_wakeup]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_WWAN_Stat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_WWAN_Stat;
							xFer[3] = current_IgEvent[NUM_WWAN_status];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD32_LEN;

							aewin_dbg("\n\rGet WWAN status: %d", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_WWAN_Stat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + MCU_SCMD33_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + MCU_SCMD33_LEN)])) break;
							current_IgEvent[NUM_WWAN_status]=recv1[5];

							if(current_IgEvent[NUM_WWAN_status] == 1)
							{
								wwan_command = 1;
							}
							else if(current_IgEvent[NUM_WWAN_status] == 0)
							{
								wwan_command = 2;
							}
							flag_flashWrite = 1;

							aewin_dbg("\n\rSet WWAN status: %d", current_IgEvent[NUM_WWAN_status]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_DigiIn:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_DigiIn;
							//xFer[3] = ((sva_gpi.ig_sw) || (sva_gpi.pwr_btn<<1) || (sva_gpi.sys_pwron<<2));
							xFer[3] = sva_gpi.ebtn_in;

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD32_LEN;

							aewin_dbg("\n\rGet GPIO digital input : %x", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_DigiOut:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_DigiOut;
							xFer[3] = sva_gpo.ebtn_out;

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD36_LEN;

							aewin_dbg("\n\rGet GPIO digital output : %x", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_DigiOut:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + MCU_SCMD37_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + MCU_SCMD37_LEN)])) break;
							sva_gpo.ebtn_out = (recv1[5] & 0x01);
							HAL_GPIO_WritePin(GPIOC, EBTN_OUT_Pin, (recv1[5] & 0x01));

							aewin_dbg("\n\rSet GPIO digital output : %x", sva_gpo.ebtn_out);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_SIM_Mode:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_SIM_Mode;
							xFer[3] = current_IgEvent[NUM_sim_card_mode];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD3A_LEN;

							aewin_dbg("\n\rGet SIM card select: %d", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_SIM_Mode:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + MCU_SCMD3B_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + MCU_SCMD3B_LEN)])) break;
							current_IgEvent[NUM_sim_card_mode]=recv1[5];

							flag_flashWrite = 1;

							aewin_dbg("\n\rSet SIM card select: %d", current_IgEvent[NUM_sim_card_mode]);
							//Write flash
							break;

						//-----------------------------------------------------
						case Subcmd_Get_WIFI_OnOff:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_WIFI_OnOff;
							xFer[3] = current_IgEvent[NUM_wifi_status];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD40_LEN;

							aewin_dbg("\n\rGet WIFI status: %d", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_WIFI_OnOff:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + MCU_SCMD41_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + MCU_SCMD41_LEN)])) break;
							current_IgEvent[NUM_wifi_status]=recv1[5];

							flag_flashWrite = 1;

							aewin_dbg("\n\rSet WIFI status: %d", current_IgEvent[NUM_wifi_status]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_LAN_WKStat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_LAN_WKStat;
							xFer[3] = current_IgEvent[NUM_LAN_wakeup];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD44_LEN;

							aewin_dbg("\n\rGet LAN wake up enable/disable: %d", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_LAN_WKStat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + MCU_SCMD45_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + MCU_SCMD45_LEN)])) break;
							current_IgEvent[NUM_LAN_wakeup]=recv1[5];

							flag_flashWrite = 1;

							aewin_dbg("\n\rSet LAN wake up enable/disable: %d", current_IgEvent[NUM_LAN_wakeup]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_DelayOffStat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_DelayOffStat;
							xFer[3] = current_IgEvent[NUM_delay_off_setting];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD50_LEN;

							aewin_dbg("\n\rGet delay off enable/disable: %d", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_DelayOffStat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + MCU_SCMD51_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + MCU_SCMD51_LEN)])) break;
							current_IgEvent[NUM_delay_off_setting]=recv1[5];

							flag_flashWrite = 1;

							aewin_dbg("\n\rSet delay off enable/disable: %d", current_IgEvent[NUM_delay_off_setting]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_DelayOnStat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_DelayOnStat;
							xFer[3] = current_IgEvent[NUM_delay_on_setting];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD52_LEN;

