sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
			//-------------------------------------------------------------------------------------
			case IG_Start_Up:
				//if(ig_event.startup_timeout > 0){
				//if(current_IgEvent[NUM_startup_timeout] > 0){
				if(countdown_timer.startup_timeout > 0){
					/* Lock ignition off to prevent that user shutdowns the OS. */
					//ig_event.startup_timeout--;
					//current_IgEvent[NUM_startup_timeout]--;
					countdown_timer.startup_timeout--;
					aewin_dbg("\n\rLock power on!");
				}
				else{
					if( sva_gpi.ig_sw ==  GPIO_PIN_RESET){
						//ig_event.IG_States = IG_Shutdown_Delay;
						//current_IgEvent[NUM_ig_states] = IG_Shutdown_Delay;
						ig_var.ig_states = IG_Shutdown_Delay;
						aewin_dbg("\n\rIngition switch off! IG_Start_Up --> IG_Shutdown_Delay");
					}
				}

				if(sva_gpi.pwr_btn == GPIO_PIN_RESET){
					//ig_event.pwrbtn_pressed = TRUE;
					//current_IgEvent[NUM_pwrbtn_pressed] = TRUE;
					ig_var.pwrbtn_pressed = TRUE;
					//if(0 == (ig_event.pwroff_btn_cnt--)){
					//if(0 == (current_IgEvent[NUM_pwroff_btn_cnt]--)){
					if(0 == (countdown_timer.pwroff_btn_cnt--)){
						HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_RESET);
						enable_4GModule();
						//ig_event.IG_States = IG_Recovery;
						//current_IgEvent[NUM_ig_states] = IG_Recovery;
						ig_var.ig_states = IG_Recovery;
					}
				}

				//if(ig_event.pwrbtn_pressed && (sva_gpi.pwr_btn == GPIO_PIN_SET)){
				//if(current_IgEvent[NUM_pwrbtn_pressed] && (sva_gpi.pwr_btn == GPIO_PIN_SET)){
				if(ig_var.pwrbtn_pressed && (sva_gpi.pwr_btn == GPIO_PIN_SET)){
					//ig_event.pwroff_btn_cnt = gIG_Event.pwroff_btn_cnt;
					//current_IgEvent[NUM_pwroff_btn_cnt] = flash_IgEvent[NUM_pwroff_btn_cnt];
					countdown_timer.pwroff_btn_cnt = current_IgEvent[NUM_pwroff_btn_cnt];
					//ig_event.pwrbtn_pressed = FALSE;
					//current_IgEvent[NUM_pwrbtn_pressed] = FALSE;
					ig_var.pwrbtn_pressed = FALSE;
					//ig_event.IG_States = IG_shutting_Down;
					//current_IgEvent[NUM_ig_states] = IG_shutting_Down;
					ig_var.ig_states = IG_shutting_Down;
					aewin_dbg("\n\rPower button off! IG_Start_Up --> IG_shutting_Down");
				}

				if(check_lowPower(adc_24v) == 1)
				{
					//current_IgEvent[NUM_ig_states] = IG_LowPower_Delay;
					ig_var.ig_states = IG_LowPower_Delay;
					aewin_dbg("\n\rPower off delay failed! IG_Shutdown_Delay --> IG_LowPower_Delay");
				}

				if(sva_gpi.sw_shutdown == GPIO_PIN_RESET)
				{
					HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_RESET);
					enable_4GModule();

					ig_var.ig_states = IG_shutting_Down;
					aewin_dbg("\n\rPower off delay pass! IG_Shutdown_Delay --> IG_shutting_Down");
				}

				break;

			//-------------------------------------------------------------------------------------
			case IG_Shutdown_Delay:
				if(sva_gpi.ig_sw == GPIO_PIN_RESET){

					if(current_IgEvent[NUM_delay_off_setting] == 0)
					{
						countdown_timer.poweroff_delay = 0;
					}

					//if (0 == (ig_event.pwroff_delay--)){
					//if (0 == (current_IgEvent[NUM_pwroff_delay]--)){
					if (0 == (countdown_timer.poweroff_delay--)){
						//ig_event.IG_States = IG_shutting_Down;
						//current_IgEvent[NUM_ig_states] = IG_shutting_Down;
						ig_var.ig_states = IG_shutting_Down;
						//ig_event.pwroff_delay = gIG_Event.pwroff_delay;
						//current_IgEvent[NUM_pwroff_delay] = flash_IgEvent[NUM_pwroff_delay];
						countdown_timer.poweroff_delay = current_IgEvent[NUM_pwroff_delay];
						aewin_dbg("\n\rPower off delay pass! IG_Shutdown_Delay --> IG_shutting_Down");
					}
					else
					{
						aewin_dbg("\n\rpwroff_delay_countdown:%d",countdown_timer.poweroff_delay);
					}
				}
				else{
					//ig_event.IG_States = IG_Start_Up;
					//current_IgEvent[NUM_ig_states] = IG_Start_Up;
					ig_var.ig_states = IG_Start_Up;
					//ig_event.pwroff_delay = gIG_Event.pwroff_delay;
					current_IgEvent[NUM_pwroff_delay] = flash_IgEvent[NUM_pwroff_delay];
					aewin_dbg("\n\rPower off delay failed! IG_Shutdown_Delay --> IG_Start_Up");
				}

				if(check_lowPower(adc_24v) == 1)
				{
					//current_IgEvent[NUM_ig_states] = IG_LowPower_Delay;
					ig_var.ig_states = IG_LowPower_Delay;
					//current_IgEvent[NUM_pwroff_delay] = flash_IgEvent[NUM_pwroff_delay];
					countdown_timer.poweroff_delay = current_IgEvent[NUM_pwroff_delay];
					aewin_dbg("\n\rPower off delay failed! IG_Shutdown_Delay --> IG_LowPower_Delay");
				}

				break;

			//-------------------------------------------------------------------------------------
			case IG_shutting_Down:
				if(sva_gpi.sw_shutdown == GPIO_PIN_RESET)
				{
					if(sva_gpi.ig_sw == GPIO_PIN_RESET)
					{
						ig_var.ig_states = IG_CloseUp;
						aewin_dbg("\n\rIgnition signal low! IG_shutting_Down --> IG_CloseUp");
					}
				}
				else if(sva_gpi.ig_sw == GPIO_PIN_RESET){
					//if (0 == (ig_event.shutdown_delay--)){
					//if (0 == (current_IgEvent[NUM_shutdown_delay]--)){
					if (0 == (countdown_timer.shutdown_delay--)){
						//ig_event.IG_States = IG_CloseUp;
						//current_IgEvent[NUM_ig_states] = IG_CloseUp;
						ig_var.ig_states = IG_CloseUp;
						//ig_event.shutdown_delay = gIG_Event.shutdown_delay;
						//current_IgEvent[NUM_shutdown_delay] = flash_IgEvent[NUM_shutdown_delay];
						countdown_timer.shutdown_delay = current_IgEvent[NUM_shutdown_delay];
						HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_RESET);
						enable_4GModule();
						aewin_dbg("\n\rShutdown delay pass! IG_shutting_Down --> IG_CloseUp");
					}
				}
				else{
					//ig_event.IG_States = IG_Shutdown_Delay;
					//current_IgEvent[NUM_ig_states] = IG_Shutdown_Delay;
					ig_var.ig_states = IG_Shutdown_Delay;
					//ig_event.shutdown_delay = gIG_Event.shutdown_delay;
					//current_IgEvent[NUM_shutdown_delay] = flash_IgEvent[NUM_shutdown_delay];
					countdown_timer.shutdown_delay = current_IgEvent[NUM_shutdown_delay];
					aewin_dbg("\n\rShutdown delay failed! IG_shutting_Down --> IG_Shutdown_Delay");
				}

				if(sva_gpi.sw_shutdown == GPIO_PIN_RESET)
				{
					if(sva_gpi.ig_sw == GPIO_PIN_RESET)
					{
						ig_var.ig_states = IG_CloseUp;
					}
				}

				break;

