sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
void print_atCommand(uint8_t rx_msg[], uint8_t onOff)
{
	int i;
	if(onOff == 1)
	{
		aewin_dbg("=====AT command=====\r\n");
		for(i=0;i<UART2_RX_LENGTH;i++)
		{
			aewin_dbg("%c",rx_msg[i]);
		}
		aewin_dbg("---------------------\r\n");
	}
}

uint8_t check_lowPower(uint32_t adc_value)
{
	uint8_t low_std = 9*10 + current_IgEvent[NUM_12V_shutdown]*5;
	//low_std = current_IgEvent[NUM_in_volt_min]*10;
	uint8_t current_voltage = (adc_voltageConversion_int(adc_value)*10 + (adc_voltageConversion_float(adc_value)/10) );

	if( current_voltage < low_std)
	{
		//aewin_dbg("Current Voltage %d V is lower than shutdown power setting %d V.\r\n", current_voltage, low_std);
		return 1;
	}
	else
	{
		//aewin_dbg("Current Voltage %d V is higher than shutdown power setting %d V.\r\n", current_voltage, low_std);
		return 0;
	}
}

uint8_t check_highPower(uint32_t adc_value)
{
	uint8_t high_std = 10*10 + current_IgEvent[NUM_12V_startup]*5;
	uint8_t current_voltage = (adc_voltageConversion_int(adc_value)*10 + (adc_voltageConversion_float(adc_value)/10) );

	if( current_voltage > high_std)
	{
		//aewin_dbg("\r\nCurrent Voltage %d V is higher than startup power setting %d V.\r\n", current_voltage, high_std);
		return 1;
	}
	else
	{
		//aewin_dbg("\r\nCurrent Voltage %d V is lower than startup power setting %d V.\r\n", current_voltage, high_std);
		return 0;
	}
}

void config_recovery(void)
{
	uint8_t data_index;

	for(data_index = 0; data_index<NUM_total;data_index++)
	{
		current_IgEvent[data_index] = flash_IgEvent[data_index];
	}

}


/* Function to perform jump to system memory boot from user application
*
* Call function when you want to jump to system memory
*/
void JumpToBootloader(void) {
   void (*SysMemBootJump)(void);

   /**
    * Step: Set system memory address.
    *
    *       For STM32F429, system memory is on 0x1FFF 0000
    *       For STM32F09x, system memory is on 0x1FFFD800
    *       For other families, check AN2606 document table 110 with descriptions of memory addresses
    */
   //volatile uint32_t addr = 0x1FFF0000;
   volatile uint32_t addr = 0x1FFFD800;

   __HAL_RCC_USART1_FORCE_RESET();
	HAL_Delay(5);
	__HAL_RCC_USART1_RELEASE_RESET();
	HAL_Delay(5);

   /**
    * Step: Disable RCC, set it to default (after reset) settings
    *       Internal clock, no PLL, etc.
    */
#if defined(USE_HAL_DRIVER)
   HAL_RCC_DeInit();
#endif /* defined(USE_HAL_DRIVER) */
#if defined(USE_STDPERIPH_DRIVER)
   RCC_DeInit();
#endif /* defined(USE_STDPERIPH_DRIVER) */

   /**
    * Step: Disable systick timer and reset it to default values
    */
   SysTick->CTRL = 0;
   SysTick->LOAD = 0;
   SysTick->VAL = 0;

   /**
    * Step: Disable all interrupts
    */
   __disable_irq();

   /**
    * Step: Remap system memory to address 0x0000 0000 in address space
    *       For each family registers may be different.
    *       Check reference manual for each family.
    *
    *       For STM32F4xx, MEMRMP register in SYSCFG is used (bits[1:0])
    *       For STM32F0xx, CFGR1 register in SYSCFG is used (bits[1:0])
    *       For others, check family reference manual
    */
   //Remap by hand... {
#if defined(STM32F4)
   //SYSCFG->MEMRMP = 0x01;
#endif
#if defined(STM32F0)
   //SYSCFG->CFGR1 = 0x01;
#endif
   //} ...or if you use HAL drivers
   __HAL_SYSCFG_REMAPMEMORY_SYSTEMFLASH();    //Call HAL macro to do this for you


   /* Test if user code is programmed starting from address "APPLICATION_ADDRESS" */
         //if (((*(__IO uint32_t*)APPLICATION_ADDRESS) & 0x2FFE0000 ) == 0x20000000)
         {
           /* Jump to user application */
           JumpAddress = *(__IO uint32_t*) (APPLICATION_ADDRESS + 4);
           JumpToApplication = (pFunction) JumpAddress;
           /* Initialize user application's Stack Pointer */
           __set_MSP(*(__IO uint32_t*) APPLICATION_ADDRESS);
           JumpToApplication();
         }

   /**
    * Step: Set jump memory location for system memory
    *       Use address with 4 bytes offset which specifies jump location where program starts
    */
   //SysMemBootJump = (void (*)(void)) (*((uint32_t *)(addr + 4)));

   /**
    * Step: Set main stack pointer.
    *       This step must be done last otherwise local variables in this function
    *       don't have proper value since stack pointer is located on different position
    *
    *       Set direct address location which specifies stack pointer in SRAM location
    */
   //__set_MSP(*(uint32_t *)addr);

   /**
    * Step: Actually call our function to jump to set location
    *       This will start system memory execution
    */
   //SysMemBootJump();

   /**
    * Step: Connect USB<->UART converter to dedicated USART pins and test
    *       and test with bootloader works with STM32 Flash Loader Demonstrator software
    */
}

/* USER CODE END Application */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
